// 447p 예제 15-1 포인터와 2중 포인터의 관계

#include <stdio.h>

int main() 
{
	int a = 10;
	int* pi = &a;
	int** ppi = &pi;

	puts("------------------------------------------------------------------------");
	printf("변수 %-16s %-16s %-16s %-16s\n", "변수값", "&연산", "*연산", "**연산");
	puts("------------------------------------------------------------------------");

	printf("  a %-16d %-16p\n", a, &a);
	printf(" pi %-16p %-16p %-16d\n", pi, &pi, *pi);
	printf("ppi %-16p %-16p %-16p %-16d\n", ppi, &ppi, *ppi, **ppi);

	return 0;
}